Revit 2025 API
ParameterTypeId.RebarHookRotationAtStartSchedulesTagsFilters Property
 "Hook Rotation At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public static ForgeTypeId RebarHookRotationAtStartSchedulesTagsFilters { get; }
Public Shared ReadOnly Property RebarHookRotationAtStartSchedulesTagsFilters As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarHookRotationAtStartSchedulesTagsFilters {
	ForgeTypeId^ get ();
}
static member RebarHookRotationAtStartSchedulesTagsFilters : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace